Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.istio.data.kubernetes_service.istio_ingressgateway: Reading...
module.istio.data.kubernetes_service.istio_ingressgateway: Read complete after 0s [id=istio-system/istio-ingressgateway]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # module.cloudflare.cloudflare_dns_record.atlantis will be destroyed
  # (because cloudflare_dns_record.atlantis is not in configuration)
- resource "cloudflare_dns_record" "atlantis" {
      - content     = "34.47.92.167" -> null
      - created_on  = "2025-01-24T21:24:01Z" -> null
      - id          = "b186982eca5758b11d39f8deddbe4c17" -> null
      - meta        = jsonencode(
            {
              - auto_added             = false
              - managed_by_apps        = false
              - managed_by_argo_tunnel = false
            }
        ) -> null
      - modified_on = "2025-01-28T10:52:44Z" -> null
      - name        = "atlantis.goboolean.io" -> null
      - proxiable   = true -> null
      - proxied     = true -> null
      - settings    = {} -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "A" -> null
      - zone_id     = "2f3b3e1ac8aef4974affafcc6b13b9c1" -> null
    }

  # module.cloudflare.cloudflare_dns_record.istio-gateway will be created
+ resource "cloudflare_dns_record" "istio-gateway" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = "34.47.92.167"
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "*.goboolean.io"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "A"
      + zone_id             = "2f3b3e1ac8aef4974affafcc6b13b9c1"
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
